mentatpsi/Microchip/Graphics/Multi-App/Configs/HWP_MEB_dsPIC33E_SK_8PMP_USBMSD.h
#elif defined (MIKRO_BOARD)
    #if defined(__PIC24FJ256GB110__)
        #define HardwareButtonInit()
        #define GetHWButtonProgram()        (HW_BUTTON_RELEASE)
        #define GetHWButtonScanDown()       (HW_BUTTON_RELEASE)
        #define GetHWButtonScanUp()         (HW_BUTTON_RELEASE)
        #define GetHWButtonCR()             (HW_BUTTON_RELEASE)
        #define GetHWButtonFocus()          (HW_BUTTON_RELEASE)
    #endif
#else
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define HardwareButtonInit()
        #define GetHWButtonProgram()    (_RA9)
        #define GetHWButtonScanDown()   (_RA9)
        #define GetHWButtonScanUp()		(HW_BUTTON_RELEASE)
        #define GetHWButtonCR()			(HW_BUTTON_RELEASE)
        #define GetHWButtonFocus()  	(HW_BUTTON_RELEASE)
    #elif defined (PIC32_SK) 
        #ifdef USE_16BIT_PMP
            #define HardwareButtonInit()
            #define GetHWButtonProgram()        (HW_BUTTON_RELEASE)
            #define GetHWButtonScanDown()       (HW_BUTTON_RELEASE)
            #define GetHWButtonScanUp()         (HW_BUTTON_RELEASE)
            #define GetHWButtonCR()             (HW_BUTTON_RELEASE)
            #define GetHWButtonFocus()          (HW_BUTTON_RELEASE)
        #else
            #define HardwareButtonInit()        (CNPUESET = _CNPUE_CNPUE16_MASK | _CNPUE_CNPUE15_MASK | _CNPUE_CNPUE19_MASK)
            #define GetHWButtonProgram()        (PORTDbits.RD6)
            #define GetHWButtonScanDown()       (HW_BUTTON_RELEASE)
            #define GetHWButtonScanUp()         (HW_BUTTON_RELEASE)  
            #define GetHWButtonCR()             (PORTDbits.RD6)
            #define GetHWButtonFocus()          (PORTDbits.RD7 & PORTDbits.RD13)
        #endif
    #else
        #if defined(__dsPIC33E__) || defined(__PIC24E__)
            #define HardwareButtonInit()        ANSELDbits.ANSD6 = ANSEL_DIGITAL; ANSELDbits.ANSD7 = ANSEL_DIGITAL; ANSELAbits.ANSA7 = ANSEL_DIGITAL;
        #else
            #define HardwareButtonInit()
        #endif

        #ifdef USE_16BIT_PMP
            #define GetHWButtonProgram()        (PORTAbits.RA7)
            #define GetHWButtonScanDown()       (HW_BUTTON_RELEASE)
            #define GetHWButtonScanUp()         (HW_BUTTON_RELEASE)
            #define GetHWButtonCR()             (HW_BUTTON_RELEASE)
            #define GetHWButtonFocus()          (HW_BUTTON_RELEASE)
        #else
            #define GetHWButtonProgram()        (PORTDbits.RD7)
            #define GetHWButtonScanDown()       (PORTDbits.RD13)
            #define GetHWButtonScanUp()         (PORTAbits.RA7)  
            #define GetHWButtonCR()             (PORTDbits.RD6)
            #define GetHWButtonFocus()          (PORTDbits.RD7)
        #endif
    #endif
#endif 


/*********************************************************************
* IOS FOR THE UART
*********************************************************************/
#if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
    #define TX_TRIS TRISCbits.TRISC1
    #define RX_TRIS TRISCbits.TRISC0
#elif defined(__PIC24FJ256DA210__)    
    #define TX_TRIS TRISFbits.TRISF3
    #define RX_TRIS TRISDbits.TRISD0
#else
    #define TX_TRIS TRISFbits.TRISF5
    #define RX_TRIS TRISFbits.TRISF4
#endif

/*********************************************************************
* RTCC DEFAULT INITIALIZATION (these are values to initialize the RTCC
*********************************************************************/
#define RTCC_DEFAULT_DAY        13      // 13th
#define RTCC_DEFAULT_MONTH      2       // February
#define RTCC_DEFAULT_YEAR       12      // 2012
#define RTCC_DEFAULT_WEEKDAY    1       // Monday
#define RTCC_DEFAULT_HOUR       10      // 10:10:01
#define RTCC_DEFAULT_MINUTE     10
#define RTCC_DEFAULT_SECOND     1

#if defined (MEB_BOARD)

	#if defined(__PIC32MX__)
		#include <plib.h>
		
		/*********************************************************************
		* Configuration for the CPLD
		*********************************************************************/
		#ifdef USE_16BIT_PMP
		#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_16BIT
		#else
		#define GRAPHICS_HW_CONFIG     CPLD_GFX_CONFIG_8BIT
		#endif
		
		/*********************************************************************
		* MMB LEDs
		*********************************************************************/
		typedef enum
		{
		    LED_2,
		    LED_3,
		    LED_4,
		    LED_5,
		    LED_10
		}MMB_LED;
		
		extern inline void __attribute__((always_inline)) SetLEDDirection(void)
		{
		   PORTSetPinsDigitalOut(IOPORT_D, (BIT_1 | BIT_2 | BIT_3));
		    PORTSetPinsDigitalOut(IOPORT_C, (BIT_1 | BIT_2));
		}
		
		extern inline void __attribute__((always_inline)) TurnLEDOn(MMB_LED led)
		{
		    if(led == LED_2)
		      PORTSetBits(IOPORT_D, BIT_1);
		
		    if(led == LED_3)
		      PORTSetBits(IOPORT_D, BIT_2);
		
		    if(led == LED_4)
		      PORTSetBits(IOPORT_D, BIT_3);
		
		    if(led == LED_5)
		      PORTSetBits(IOPORT_C, BIT_1);
		
		    if(led == LED_10)
		      PORTSetBits(IOPORT_C, BIT_2);
		
		}
		
		extern inline void __attribute__((always_inline)) TurnLEDOff(MMB_LED led)
		{
		    if(led == LED_2)
		      PORTClearBits(IOPORT_D, BIT_1);
		
		    if(led == LED_3)
		      PORTClearBits(IOPORT_D, BIT_2);
		
		    if(led == LED_4)
		      PORTClearBits(IOPORT_D, BIT_3);
		
		    if(led == LED_5)
		      PORTClearBits(IOPORT_C, BIT_1);
		
		    if(led == LED_10)
		      PORTClearBits(IOPORT_C, BIT_2);
		
		}
		
		extern inline void __attribute__((always_inline)) ToggleLED(MMB_LED led)
		{
		    if(led == LED_2)
		      PORTToggleBits(IOPORT_D, BIT_1);
		
		    if(led == LED_3)
		      PORTToggleBits(IOPORT_D, BIT_2);
		
		    if(led == LED_4)
		      PORTToggleBits(IOPORT_D, BIT_3);
		
		    if(led == LED_5)
		      PORTToggleBits(IOPORT_C, BIT_1);
		
		    if(led == LED_10)
		      PORTToggleBits(IOPORT_C, BIT_2);
		
		}
		
		extern inline void __attribute__((always_inline)) TurnLEDAllOn(void)
		{
		      PORTSetBits(IOPORT_D, BIT_1);
		      PORTSetBits(IOPORT_D, BIT_2);
		      PORTSetBits(IOPORT_D, BIT_3);
		      PORTSetBits(IOPORT_C, BIT_1);
		      PORTSetBits(IOPORT_C, BIT_2);
		
